[{"level":" Intermediate","equipment":" Kettlebells","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/505/Male/l/505_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/505/Male/l/505_2.jpg","muscle":"Alternating Kettlebell Row","type":" Pull","guide":["Place two kettlebells in front of your feet. Bend your knees slightly and push your butt out as much as possible. As you bend over to get into the starting position grab both kettlebells by the handles.","Pull one kettlebell off of the floor while holding on to the other kettlebell. Retract the shoulder blade of the working side, as you flex the elbow, drawing the kettlebell towards your stomach or rib cage.","Lower the kettlebell in the working arm and repeat with your other arm."]},{"level":" Expert","equipment":" Kettlebells","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/506/Male/l/506_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/506/Male/l/506_2.jpg","muscle":"Alternating Renegade Row","type":" Pull","guide":["Place two kettlebells on the floor about shoulder width apart. Position yourself on your toes and your hands as though you were doing a pushup, with the body straight and extended. Use the handles of the kettlebells to support your upper body. You may need to position your feet wide for support.","Push one kettlebell into the floor and row the other kettlebell, retracting the shoulder blade of the working side as you flex the elbow, pulling it to your side.","Then lower the kettlebell to the floor and begin the kettlebell in the opposite hand. Repeat for several reps."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/727/Male/l/727_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/727/Male/l/727_2.jpg","muscle":"Atlas Stone Trainer","type":" Pull","guide":["This trainer is effective for developing Atlas Stone strength for those who don't have access to stones, and are typically made from bar ends or heavy pipe.","Begin by loading the desired weight onto the bar. Straddle the weight, wrapping your arms around the implement, bending at the hips.","Begin by pulling the weight up past the knees, extending through the hips. As the weight clears the knees, it can be lapped by resting it on your thighs and sitting back, hugging it tightly to your chest.","Finish the movement by extending through your hips and knees to raise the weight as high as possible. The weight can be returned to the lap or to the ground for successive repetitions."]},{"level":" Expert","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/659/Male/l/659_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/659/Male/l/659_2.jpg","muscle":"Atlas Stones","type":" Pull","guide":["Begin with the atlas stone between your feet. Bend at the hips to wrap your arms vertically around the Atlas Stone, attempting to get your fingers underneath the stone. Many stones will have a small flat portion on the bottom, which will make the stone easier to hold.","Pulling the stone into your torso, drive through the back half of your feet to pull the stone from the ground.","As the stone passes the knees, lap it by sitting backward, pulling the stone on top of your thighs.","Sit low, getting the stone high onto your chest as you change your grip to reach over the stone. Stand, driving through with your hips. Close distance to the loading platform, and lean back, extending the hips to get the stone as high as possible."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/750/Male/l/750_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/750/Male/l/750_2.jpg","muscle":"Axle Deadlift","type":" Pull","guide":["Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an over/under grip.","With your feet and your grip set, take a big breath and then lower your hips and flex the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward.","After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."]},{"level":" Beginner","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/849/Male/l/849_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/849/Male/l/849_2.jpg","muscle":"Band Assisted Pull-Up","type":" N/A","guide":["Choke the band around the center of the pullup bar. You can use different bands to provide varying levels of assistance.","Pull the end of the band down, and place one bent knee into the loop, ensuring it won't slip out. Take a medium to wide grip on the bar. This will be your starting position.","Pull yourself upward by contracting the lats as you flex the elbow. The elbow should be driven to your side. Pull to the front, attempting to get your chin over the bar. Avoid swinging or jerking movements.","After a brief pause, return to the starting position."]},{"level":" Intermediate","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/112/Male/l/112_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/112/Male/l/112_2.jpg","muscle":"Barbell Deadlift","type":" Pull","guide":["Stand in front of a loaded barbell.","While keeping the back as straight as possible, bend your knees, bend forward and grasp the bar using a medium (shoulder width) overhand grip. This will be the starting position of the exercise. Tip: If it is difficult to hold on to the bar with this grip, alternate your grip or use wrist straps.","While holding the bar, start the lift by pushing with your legs while simultaneously getting your torso to the upright position as you breathe out. In the upright position, stick your chest out and contract the back by bringing the shoulder blades back. Think of how the soldiers in the military look when they are in standing in attention.","Go back to the starting position by bending at the knees while simultaneously leaning the torso forward at the waist while keeping the back straight. When the weights on the bar touch the floor you are back at the starting position and ready to perform another repetition.","Perform the amount of repetitions prescribed in the program."]},{"level":" Beginner","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/20/Male/l/20_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/20/Male/l/20_2.jpg","muscle":"Bent Over Barbell Row","type":" Pull","guide":["Holding a barbell with a pronated grip (palms facing down), bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The barbell should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","Now, while keeping the torso stationary, breathe out and lift the barbell to you. Keep the elbows close to the body and only use the forearms to hold the weight. At the top contracted position, squeeze the back muscles and hold for a brief pause.","Then inhale and slowly lower the barbell back to the starting position.","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/19/Male/l/19_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/19/Male/l/19_2.jpg","muscle":"Bent Over One-Arm Long Bar Row","type":" Pull","guide":["Put weight on one of the ends of an Olympic barbell. Make sure that you either place the other end of the barbell in the corner of two walls; or put a heavy object on the ground so the barbell cannot slide backward.","Bend forward until your torso is as close to parallel with the floor as you can and keep your knees slightly bent.","Now grab the bar with one arm just behind the plates on the side where the weight was placed and put your other hand on your knee. This will be your starting position.","Pull the bar straight up with your elbow in (to maximize back stimulation) until the plates touch your lower chest. Squeeze the back muscles as you lift the weight up and hold for a second at the top of the movement. Breathe out as you lift the weight. Tip: Do not allow for any swinging of the torso. Only the arm should move.","Slowly lower the bar to the starting position getting a nice stretch on the lats. Tip: Do not let the plates touch the floor. To ensure the best range of motion, I recommend using small plates (25-lb ones) as opposed to larger plates (like 35-45lb ones).","Repeat for the recommended amount of repetitions and switch arms."]},{"level":" Intermediate","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/18/Male/l/18_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/18/Male/l/18_2.jpg","muscle":"Bent Over Two-Arm Long Bar Row","type":" Pull","guide":["Put weight on one of the ends of an Olympic barbell. Make sure that you either place the other end of the barbell in the corner of two walls; or put a heavy object on the ground so the barbell cannot slide backward.","Bend forward until your torso is as close to parallel with the floor as you can and keep your knees slightly bent.","Now grab the bar with both arms just behind the plates on the side where the weight was placed and put your other hand on your knee. This will be your starting position.","Pull the bar straight up with your elbows in (to maximize back stimulation) until the plates touch your lower chest. Squeeze the back muscles as you lift the weight up and hold for a second at the top of the movement. Breathe out as you lift the weight. Tip: Use a stirrup or double handle cable attachment by hooking it under the end of the bar.","Slowly lower the bar to the starting position getting a nice stretch on the lats. Tip: Do not let the plates touch the floor. To ensure the best range of motion, I recommend using small plates (25-lb ones) as opposed to larger plates (like 35-45lb ones).","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" Dumbbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/16/Male/l/16_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/16/Male/l/16_2.jpg","muscle":"Bent Over Two-Dumbbell Row","type":" Pull","guide":["With a dumbbell in each hand (palms facing your torso), bend your knees slightly and bring your torso forward by bending at the waist; as you bend make sure to keep your back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The weights should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the dumbbells to your side (as you breathe out), keeping the elbows close to the body (do not exert any force with the forearm other than holding the weights). On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" Dumbbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/17/Male/l/17_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/17/Male/l/17_2.jpg","muscle":"Bent Over Two-Dumbbell Row With Palms In","type":" Pull","guide":["With a dumbbell in each hand (palms facing each other), bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The weights should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the dumbbells to your side as you breathe out, squeezing your shoulder blades together. On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."]},{"level":" Intermediate","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/49/Male/l/49_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/49/Male/l/49_2.jpg","muscle":"Bent-Arm Barbell Pullover","type":" Pull","guide":["Lie on a flat bench with a barbell using a shoulder grip width.","Hold the bar straight over your chest with a bend in your arms. This will be your starting position.","While keeping your arms in the bent arm position, lower the weight slowly in an arc behind your head while breathing in until you feel a stretch on the chest.","At that point, bring the barbell back to the starting position using the arc through which the weight was lowered and exhale as you perform this movement.","Hold the weight on the initial position for a second and repeat the motion for the prescribed number of repetitions."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1911/Male/l/1911_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1911/Male/l/1911_2.jpg","muscle":"Bodyweight Mid Row","type":" Pull","guide":["Begin by taking a medium to wide grip on a pull-up apparatus with your palms facing away from you. From a hanging position, tuck your knees to your chest, leaning back and getting your legs over your side of the pull-up apparatus. This will be your starting position.","Beginning with your arms straight, flex the elbows and retract the shoulder blades to raise your body up until your legs contact the pull-up apparatus.","After a brief pause, return to the starting position."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/313/Male/l/313_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/313/Male/l/313_2.jpg","muscle":"Cable Incline Pushdown","type":" Pull","guide":["Lie on incline an bench facing away from a high pulley machine that has a straight bar attachment on it.","Grasp the straight bar attachment overhead with a pronated (overhand; palms down) shoulder width grip and extend your arms in front of you. The bar should be around 2 inches away from your upper thighs. This will be your starting position.","Keeping the upper arms stationary, lift your arms back in a semi circle until the bar is straight over your head. Breathe in during this portion of the movement.","Slowly go back to the starting position using your lats and hold the contraction once you reach the starting position. Breathe out during the execution of this movement.","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/392/Male/l/392_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/392/Male/l/392_2.jpg","muscle":"Cat Stretch","type":" Static","guide":["Position yourself on the floor on your hands and knees.","Pull your belly in and round your spine, lower back, shoulders, and neck, letting your head drop.","Hold for 15 seconds."]},{"level":" Beginner","equipment":" Medicine Ball","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/768/Male/l/768_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/768/Male/l/768_2.jpg","muscle":"Catch and Overhead Throw","type":" Push","guide":["Begin standing while facing a wall or a partner.","Using both hands, position the ball behind your head, stretching as much as possible, and forcefully throw the ball forward.","Ensure that you follow your throw through, being prepared to receive your rebound from your throw. If you are throwing against the wall, make sure that you stand close enough to the wall to receive the rebound, and aim a little higher than you would with a partner."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/487/Male/l/487_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/487/Male/l/487_2.jpg","muscle":"Chair Lower Back Stretch","type":" Static","guide":["Sit upright on a chair.","Bend to one side with your arm over your head. You can hold onto the chair with your free hand.","Hold for 10 seconds, and repeat for your other side."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/426/Male/l/426_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/426/Male/l/426_2.jpg","muscle":"Child's Pose","type":" Static","guide":["Get on your hands and knees, walk your hands in front of you.","Lower your buttocks down to sit on your heels. Let your arms drag along the floor as you sit back to stretch your entire spine.","Once you settle onto your heels, bring your hands next to your feet and relax. \"breathe\" into your back. Rest your forehead on the floor. Avoid this position if you have knee problems."]},{"level":" Beginner","equipment":" Body Only","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/129/Male/l/129_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/129/Male/l/129_2.jpg","muscle":"Chin-Up","type":" Pull","guide":["Grab the pull-up bar with the palms facing your torso and a grip closer than the shoulder width.","As you have both arms extended in front of you holding the bar at the chosen grip width, keep your torso as straight as possible while creating a curvature on your lower back and sticking your chest out. This is your starting position. Tip: Keeping the torso as straight as possible maximizes biceps stimulation while minimizing back involvement.","As you breathe out, pull your torso up until your head is around the level of the pull-up bar. Concentrate on using the biceps muscles in order to perform the movement. Keep the elbows close to your body. Tip: The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second of squeezing the biceps in the contracted position, slowly lower your torso back to the starting position; when your arms are fully extended. Breathe in as you perform this portion of the movement.","Repeat this motion for the prescribed amount of repetitions."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/14/Male/l/14_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/14/Male/l/14_2.jpg","muscle":"Close-Grip Front Lat Pulldown","type":" Pull","guide":["Sit down on a pull-down machine with a wide bar attached to the top pulley. Make sure that you adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.","Grab the bar with the palms facing forward using the prescribed grip. Note on grips: For a wide grip, your hands need to be spaced out at a distance wider than your shoulder width. For a medium grip, your hands need to be spaced out at a distance equal to your shoulder width and for a close grip at a distance smaller than your shoulder width.","As you have both arms extended in front of you - while holding the bar at the chosen grip width - bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.","As you breathe out, bring the bar down until it touches your upper chest by drawing the shoulders and the upper arms down and back. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary (only the arms should move). The forearms should do no other work except for holding the bar; therefore do not try to pull the bar down using the forearms.","After a second in the contracted position, while squeezing your shoulder blades together, slowly raise the bar back to the starting position when your arms are fully extended and the lats are fully stretched. Inhale during this portion of the movement.","6. Repeat this motion for the prescribed amount of repetitions."]},{"level":" Intermediate","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/585/Male/l/585_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/585/Male/l/585_2.jpg","muscle":"Crossover Reverse Lunge","type":" Pull","guide":["Stand with your feet shoulder width apart. This will be your starting position.","Perform a rear lunge by stepping back with one foot and flexing the hips and front knee. As you do so, rotate your torso across the front leg.","After a brief pause, return to the starting position and repeat on the other side, continuing in an alternating fashion."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/427/Male/l/427_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/427/Male/l/427_2.jpg","muscle":"Dancer's Stretch","type":" Static","guide":["Sit up on the floor.","Cross your right leg over your left, keeping the knee bent. Your left leg is straight and down on the floor.","Place your left arm on your right leg and your right hand on the floor.","Rotate your upper body to the right, and hold for 10-20 seconds. Switch sides."]},{"level":" Expert","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/677/Male/l/677_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/677/Male/l/677_2.jpg","muscle":"Deadlift with Bands","type":" Pull","guide":["To deadlift with short bands, simply loop them over the bar before you start, and step into them to set up. For long bands, they will need to be anchored to a secure base, such as heavy dumbbells or a rack.","With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."]},{"level":" Expert","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/678/Male/l/678_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/678/Male/l/678_2.jpg","muscle":"Deadlift with Chains","type":" Pull","guide":["You can attach the chains to the sleeves of the bar, or just drape the middle over the bar so there is a greater weight increase as you lift.","Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets. With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar.","Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."]},{"level":" Intermediate","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/679/Male/l/679_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/679/Male/l/679_2.jpg","muscle":"Deficit Deadlift","type":" Pull","guide":["Begin by having a platform or weight plates that you can stand on, usually 1-3 inches in height. Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.","With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."]},{"level":" Beginner","equipment":" Dumbbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1311/Male/l/1311_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1311/Male/l/1311_2.jpg","muscle":"Dumbbell Incline Row","type":" Pull","guide":["Using a neutral grip, lean into an incline bench.","Take a dumbbell in each hand with a neutral grip, beginning with the arms straight. This will be your starting position.","Retract the shoulder blades and flex the elbows to row the dumbbells to your side.","Pause at the top of the motion, and then return to the starting position."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/586/Male/l/586_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/586/Male/l/586_2.jpg","muscle":"Dynamic Back Stretch","type":" Pull","guide":["Stand with your feet shoulder width apart. This will be your starting position.","Keeping your arms straight, swing them straight up in front of you 5-10 times, increasing the range of motion each time until your arms are above your head."]},{"level":" Intermediate","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/293/Male/l/293_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/293/Male/l/293_2.jpg","muscle":"Elevated Cable Rows","type":" Pull","guide":["Get a platform of some sort (it can be an aerobics or calf raise platform) that is around 4-6 inches in height.","Place it on the seat of the cable row machine.","Sit down on the machine and place your feet on the front platform or crossbar provided making sure that your knees are slightly bent and not locked.","Lean over as you keep the natural alignment of your back and grab the V-bar handles.","With your arms extended pull back until your torso is at a 90-degree angle from your legs. Your back should be slightly arched and your chest should be sticking out. You should be feeling a nice stretch on your lats as you hold the bar in front of you. This is the starting position of the exercise.","Keeping the torso stationary, pull the handles back towards your torso while keeping the arms close to it until you touch the abdominals. Breathe out as you perform that movement. At that point you should be squeezing your back muscles hard. Hold that contraction for a second and slowly go back to the original position while breathing in.","Repeat for the recommended amount of repetitions."]},{"level":" Intermediate","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/182/Male/l/182_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/182/Male/l/182_2.jpg","muscle":"Full Range-Of-Motion Lat Pulldown","type":" Pull","guide":["Either standing or seated on a high bench, grasp two stirrup cables that are attached to the high pulleys. Grab with the opposing hand so your arms are crisscrossed about you and your palms are facing forward.","Keeping your chest up and maintaining a slight arch in your lower back, pull the handles down as if you were doing a regular pulldown. The range of motion will be more of an arc. During the movement, rotate your hands so that in the bottom position your palms face each other rather than forward. Return slowly to the starting position and repeat."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/292/Male/l/292_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/292/Male/l/292_2.jpg","muscle":"Gironda Sternum Chins","type":" Pull","guide":["Grasp the pull-up bar with a shoulder width underhand grip.","Now hang with your arms fully extended and stick your chest out and lean back. Tip: You will be leaning back throughout the entire movement. This will be your starting position.","Start pulling yourself towards the bar with your spine arched throughout the movement and your head leaning back as far away from the bar as possible. Exhale as you perform this portion of the movement. Tip: At the upper end of the movement, your hips and legs will be at about a 45-degree angle to the floor.","Keep pulling until your collarbone passes the bar and your lower chest or sternum area touches it. Hold that contraction for a second. Tip: By the time you've completed this portion of the movement; your head will be parallel to the floor.","Slowly start going back to the starting position as you inhale.","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" Exercise Ball","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/424/Male/l/424_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/424/Male/l/424_2.jpg","muscle":"Hug A Ball","type":" Static","guide":["Seat yourself on the floor.","Straddle an exercise ball between both legs and lower your hips down toward the floor.","Hug your arms around the ball to support your body. Adjust your legs so that your feet are flat on the floor and your knees line up over your ankles. Keep a good grip on the ball so it doesn't roll away from you and send you back onto your buttocks."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/398/Male/l/398_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/398/Male/l/398_2.jpg","muscle":"Hug Knees To Chest","type":" Static","guide":["Lie down on your back and pull both knees up to your chest.","Hold your arms under the knees, not over (that would put to much pressure on your knee joints).","Slowly pull the knees toward your shoulders. This also stretches your buttocks muscles."]},{"level":" Beginner","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/47/Male/l/47_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/47/Male/l/47_2.jpg","muscle":"Hyperextensions (Back Extensions)","type":" Pull","guide":["Lie face down on a hyperextension bench, tucking your ankles securely under the footpads.","Adjust the upper pad if possible so your upper thighs lie flat across the wide pad, leaving enough room for you to bend at the waist without any restriction.","With your body straight, cross your arms in front of you (my preference) or behind your head. This will be your starting position. Tip: You can also hold a weight plate for extra resistance in front of you under your crossed arms.","Start bending forward slowly at the waist as far as you can while keeping your back flat. Inhale as you perform this movement. Keep moving forward until you feel a nice stretch on the hamstrings and you can no longer keep going without a rounding of the back. Tip: Never round the back as you perform this exercise. Also, some people can go farther than others. The key thing is that you go as far as your body allows you to without rounding the back.","Slowly raise your torso back to the initial position as you inhale. Tip: Avoid the temptation to arch your back past a straight line. Also, do not swing the torso at any time in order to protect the back from injury.","Repeat for the recommended amount of repetitions."]},{"level":" Intermediate","equipment":" Body Only","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/24/Male/l/24_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/24/Male/l/24_2.jpg","muscle":"Hyperextensions With No Hyperextension Bench","type":" Pull","guide":["With someone holding down your legs, slide yourself down to the edge a flat bench until your hips hang off the end of the bench. Tip: Your entire upper body should be hanging down towards the floor. Also, you will be in the same position as if you were on a hyperextension bench but the range of motion will be shorter due to the height of the flat bench vs. that of the hyperextension bench.","With your body straight, cross your arms in front of you (my preference) or behind your head. This will be your starting position. Tip: You can also hold a weight plate for extra resistance in front of you under your crossed arms.","Start bending forward slowly at the waist as far as you can while keeping your back flat. Inhale as you perform this movement. Keep moving forward until you almost touch the floor or you feel a nice stretch on the hamstrings (whichever comes first). Tip: Never round the back as you perform this exercise.","Slowly raise your torso back to the initial position as you exhale. Tip: Avoid the temptation to arch your back past a straight line. Also, do not swing the torso at any time in order to protect the back from injury.","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/278/Male/l/278_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/278/Male/l/278_2.jpg","muscle":"Incline Bench Pull","type":" Pull","guide":["Grab a dumbbell in each hand and lie face down on an incline bench that is set to an incline that is approximately 30 degrees.","Let the arms hang to your sides fully extended as they point to the floor.","Turn the wrists until your hands have a pronated (palms down) grip.","Now flare the elbows out. This will be your starting position.","As you breathe out, start to pull the dumbbells up as if you are doing a reverse bench press. You will do this by bending at the elbows and bringing the upper arms up as you let the forearms hang. Continue this motion until the upper arms are at the same level as your back. Tip: The elbows will come out to the side and your upper arms and torso should make the letter \"T\" at the top of the movement. Hold the contraction at the top for a second.","Slowly go back down to the starting position as you breathe in.","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/879/Male/l/879_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/879/Male/l/879_2.jpg","muscle":"Inverted Row","type":" Pull","guide":["Position a bar in a rack to about waist height. You can also use a smith machine.","Take a wider than shoulder width grip on the bar and position yourself hanging underneath the bar. Your body should be straight with your heels on the ground with your arms fully extended. This will be your starting position.","Begin by flexing the elbow, pulling your chest towards the bar. Retract your shoulder blades as you perform the movement.","Pause at the top of the motion, and return yourself to the start position.","Repeat for the desired number of repetitions."]},{"level":" Beginner","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/886/Male/l/886_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/886/Male/l/886_2.jpg","muscle":"Inverted Row with Straps","type":" Pull","guide":["Hang a rope or suspension straps from a rack or other stable object. Grasp the ends and position yourself in a supine position hanging from the ropes. Your body should be straight with your heels on the ground with your arms fully extended. This will be your starting position.","Begin by flexing the elbow, pulling your chest to your hands. Retract your shoulder blades as you perform the movement.","Pause at the top of the motion, and return yourself to the start position.","Repeat for the desired number of repetitions."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/696/Male/l/696_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/696/Male/l/696_2.jpg","muscle":"Keg Load","type":" Pull","guide":["To load kegs, place the desired number a distance from the loading platform, typically 30-50 feet.","Begin by grabbing the close handle of the first keg, tilting it onto its side to grab the opposite edge of the bottom of the keg. Lift the keg up to your chest.","The higher you can place the keg, the faster you should be able to move to the platform. Shouldering is usually not allowed. Be sure to keep a firm hold on the keg. Move as quickly as possible to the platform, and load it, extending through your hips, knees, and ankles to get it as high as possible.","Return to the starting position to retrieve the next keg, and repeat until the event is completed."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1471/Male/l/1471_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1471/Male/l/1471_2.jpg","muscle":"Kipping Muscle Up","type":" Pull","guide":["Grip the rings using a false grip, with the base of your palms on top of the rings.","Begin with a movement swinging your legs backward slightly.","Counter that movement by swinging your legs forward and up, jerking your chin and chest back, pulling yourself up with both arms as you do so. As you reach the top position of the pull-up, pull the rings to your armpits as you roll your shoulders forward, allowing your elbows to move straight back behind you. This puts you into the proper position to continue into the dip portion of the movement.","Maintaining control and stability, extend through the elbow to complete the motion.","Use care when lowering yourself to the ground."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1921/Male/l/1921_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1921/Male/l/1921_2.jpg","muscle":"Kneeling High Pulley Row","type":" Pull","guide":["Select the appropriate weight using a pulley that is above your head. Attach a rope to the cable and kneel a couple of feet away, holding the rope out in front of you with both arms extended. This will be your starting position.","Initiate the movement by flexing the elbows and fully retracting your shoulders, pulling the rope toward your upper chest with your elbows out.","After pausing briefly, slowly return to the starting position."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1991/Male/l/1991_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1991/Male/l/1991_2.jpg","muscle":"Kneeling Single-Arm High Pulley Row","type":" Pull","guide":["Attach a single handle to a high pulley and make your weight selection.","Kneel in front of the cable tower, taking the cable with one hand with your arm extended. This will be your starting position.","Starting with your palm facing forward, pull the weight down to your torso by flexing the elbow and retract the shoulder blade. As you do so, rotate the wrist so that at the completion of the movement, your palm is now facing you.","After a brief pause, return to the starting position."]},{"level":" Beginner","equipment":" Foam Roll","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/600/Male/l/600_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/600/Male/l/600_2.jpg","muscle":"Latissimus Dorsi-SMR","type":" Static","guide":["While lying on the floor, place a foam roll under your back and to one side, just behind your arm pit. This will be your starting position.","Keep the arm of the side being stretched behind and to the side of you as you shift your weight onto your lats, keeping your upper body off of the ground. Hold for 10-30 seconds, and switch sides."]},{"level":" Beginner","equipment":" Machine","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/892/Male/l/892_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/892/Male/l/892_2.jpg","muscle":"Leverage High Row","type":" Pull","guide":["Load an appropriate weight onto the pins and adjust the seat height so that you can just reach the handles above you. Adjust the knee pad to help keep you down. Grasp the handles with a pronated grip. This will be your starting position.","Pull the handles towards your torso, retracting your shoulder blades as you flex the elbow.","Pause at the bottom of the motion, and then slowly return the handles to the starting position.","For multiple repetitions, avoid completely returning the weight to the stops to keep tension on the muscles being worked."]},{"level":" Beginner","equipment":" Machine","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/894/Male/l/894_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/894/Male/l/894_2.jpg","muscle":"Leverage Iso Row","type":" Pull","guide":["Load an appropriate weight onto the pins and adjust the seat height so that the handles are at chest level. Grasp the handles with either a neutral or pronated grip. This will be your starting position.","Pull the handles towards your torso, retracting your shoulder blades as you flex the elbow.","Pause at the bottom of the motion, and then slowly return the handles to the starting position. For multiple repetitions, avoid completely returning the weight to the stops to keep tension on the muscles being worked."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1981/Male/l/1981_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1981/Male/l/1981_2.jpg","muscle":"London Bridges","type":" Pull","guide":["Attach a climbing rope to a high beam or cross member. Below it, ensure that the smith machine bar is locked in place with the safeties and cannot move. Alternatively, a secure box could also be utilized.","Stand on the bar, using the rope to balance yourself. This will be your starting position.","Keeping your body straight, lean back and lower your body by slowly going hand over hand with the rope. Continue until you are perpendicular to the ground.","Keeping your body straight, reverse the motion, going hand over hand back to the starting position."]},{"level":" Beginner","equipment":" Foam Roll","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/601/Male/l/601_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/601/Male/l/601_2.jpg","muscle":"Lower Back-SMR","type":" Static","guide":["In a seated position, place a foam roll under your lower back. Cross your arms in front of you and protract your shoulders. This will be your starting position.","Raise your hips off of the floor and lean back, keeping your weight on your lower back. Now shift your weight slightly to one side, keeping your weight off of the spine and on the muscles to the side of it. Roll over your lower back, holding points of tension for 10-30 seconds. Repeat on the other side."]},{"level":" Beginner","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/302/Male/l/302_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/302/Male/l/302_2.jpg","muscle":"Lying Cambered Barbell Row","type":" Pull","guide":["Place a cambered bar underneath an exercise bench.","Lie face down on the exercise bench and grab the bar using a palms down (pronated grip) that is wider than shoulder width. This will be your starting position.","As you exhale row the bar up as you keep the elbows close to your body to either your chest, in order to target the upper mid back, or to your stomach if targeting the lats is your goal.","After a second hold at the top, lower back down to the starting position slowly as you inhale."]},{"level":" Intermediate","equipment":" Machine","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/137/Male/l/137_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/137/Male/l/137_2.jpg","muscle":"Lying T-Bar Row","type":" Pull","guide":["Load up the T-bar Row Machine with the desired weight and adjust the leg height so that your upper chest is at the top of the pad. Tip: In some machines all you can do is stand on the appropriate step that allows you to be at a height that has the upper chest at the top of the pad.","Lay face down on the pad and grab the handles. You can either use a palms down, palms up, or palms in position depending on what part of your back you want to emphasize.","Lift the bar off the rack and extend your arms in front of you. This will be your starting position.","As you exhale slowly pull the weight up and squeeze your back at the top of the movement. Tip: Keep the upper arms as close to the torso as possible throughout the movement in order to better engage the back muscles. Also, do not lift your body off of the pad at any time and refrain from using the biceps to lift the weight.","After a second contraction at the top of the movement, as you inhale, slowly go back down to the starting position.","Repeat for the recommended amount of repetitions."]},{"level":" Intermediate","equipment":" Dumbbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/172/Male/l/172_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/172/Male/l/172_2.jpg","muscle":"Middle Back Shrug","type":" Pull","guide":["Lie facedown on an incline bench while holding a dumbbell in each hand. Your arms should be fully extended hanging down and pointing towards the floor. The palms of your hands should be facing each other. This will be your starting position.","As you exhale, squeeze your shoulder blades together and hold the contraction for a full second. Tip: This movement is just like the reverse action of a hug, or trying to perform rear laterals as if you had no arms.","As you inhale go back to the starting position.","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/483/Male/l/483_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/483/Male/l/483_2.jpg","muscle":"Middle Back Stretch","type":" Static","guide":["Stand so your feet are shoulder width apart and your hands are on your hips.","Twist at your waist until you feel a stretch. Hold for 10 to 15 seconds, then twist to the other side."]},{"level":" Expert","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/281/Male/l/281_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/281/Male/l/281_2.jpg","muscle":"Mixed Grip Chin","type":" Pull","guide":["Using a spacing that is just about 1 inch wider than shoulder width, grab a pull-up bar with the palms of one hand facing forward and the palms of the other hand facing towards you. This will be your starting position.","Now start to pull yourself up as you exhale. Tip: With the arm that has the palms facing up concentrate on using the back muscles in order to perform the movement. The elbow of that arm should remain close to the torso. With the other arm that has the palms facing forward, the elbows will be away but in line with the torso. You will concentrate on using the lats to pull your body up.","After a second contraction at the top, start to slowly come down as you inhale.","Repeat for the recommended amount of repetitions.","On the following set, switch grips; so if you had the right hand with the palms facing you and the left one with the palms facing forward, on the next set you will have the palms facing forward for the right hand and facing you for the left."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1501/Male/l/1501_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1501/Male/l/1501_2.jpg","muscle":"Muscle Up","type":" Pull","guide":["Grip the rings using a false grip, with the base of your palms on top of the rings. Initiate a pull up by pulling the elbows down to your side, flexing the elbows.","As you reach the top position of the pull-up, pull the rings to your armpits as you roll your shoulders forward, allowing your elbows to move straight back behind you. This puts you into the proper position to continue into the dip portion of the movement.","Maintaining control and stability, extend through the elbow to complete the motion.","Use care when lowering yourself to the ground."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/478/Male/l/478_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/478/Male/l/478_2.jpg","muscle":"One Arm Against Wall","type":" Static","guide":["From a standing position, place a bent arm against a wall or doorway.","Slowly lean toward your arm until you feel a stretch in your lats."]},{"level":" Expert","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/282/Male/l/282_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/282/Male/l/282_2.jpg","muscle":"One Arm Chin-Up","type":" Pull","guide":["For this exercise, start out by placing a towel around a chin up bar.","Grab the chin-up bar with your palm facing you. One hand will be grabbing the chin-up bar and the other will be grabbing the towel.","Bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.v","Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.","Repeat this motion for the prescribed amount of repetitions.","Switch arms and repeat the movement."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/904/Male/l/904_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/904/Male/l/904_2.jpg","muscle":"One Arm Lat Pulldown","type":" Pull","guide":["Select an appropriate weight and adjust the knee pad to help keep you down. Grasp the handle with a pronated grip. This will be your starting position.","Pull the handle down, squeezing your elbow to your side as you flex the elbow.","Pause at the bottom of the motion, and then slowly return the handle to the starting position.","For multiple repetitions, avoid completely returning the weight to keep tension on the muscles being worked."]},{"level":" Beginner","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/446/Male/l/446_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/446/Male/l/446_2.jpg","muscle":"One Handed Hang","type":" Static","guide":["Grab onto a chinup bar with one hand, using a pronated grip. Keep your feet on the floor or a step. Allow the majority of your weight to hang from that hand, while keeping your feet on the ground. Hold for 10-20 seconds and switch sides."]},{"level":" Beginner","equipment":" Dumbbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/13/Male/l/13_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/13/Male/l/13_2.jpg","muscle":"One-Arm Dumbbell Row","type":" Pull","guide":["Choose a flat bench and place a dumbbell on each side of it.","Place the right leg on top of the end of the bench, bend your torso forward from the waist until your upper body is parallel to the floor, and place your right hand on the other end of the bench for support.","Use the left hand to pick up the dumbbell on the floor and hold the weight while keeping your lower back straight. The palm of the hand should be facing your torso. This will be your starting position.","Pull the resistance straight up to the side of your chest, keeping your upper arm close to your side and keeping the torso stationary. Breathe out as you perform this step. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. Also, make sure that the force is performed with the back muscles and not the arms. Finally, the upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the dumbbell; therefore do not try to pull the dumbbell up using the forearms.","Lower the resistance straight down to the starting position. Breathe in as you perform this step.","Repeat the movement for the specified amount of repetitions.","Switch sides and repeat again with the other arm."]},{"level":" Intermediate","equipment":" Kettlebells","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/516/Male/l/516_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/516/Male/l/516_2.jpg","muscle":"One-Arm Kettlebell Row","type":" Pull","guide":["Place a kettlebell in front of your feet. Bend your knees slightly and then push your butt out as much as possible as you bend over to get in the starting position. Grab the kettlebell and pull it to your stomach, retracting your shoulder blade and flexing the elbow. Keep your back straight. Lower and repeat."]},{"level":" Beginner","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1941/Male/l/1941_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1941/Male/l/1941_2.jpg","muscle":"One-Arm Long Bar Row","type":" Pull","guide":["Position a bar into a landmine or in a corner to keep it from moving. Load an appropriate weight onto your end.","Stand next to the bar, and take a grip with one hand close to the collar. Using your hips and legs, rise to a standing position.","Assume a bent-knee stance with your hips back and your chest up. Your arm should be extended. This will be your starting position.","Pull the weight to your side by retracting the shoulder and flexing the elbow. Do not jerk the weight or cheat during the movement.","After a brief pause, return to the starting position."]},{"level":" Expert","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/609/Male/l/609_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/609/Male/l/609_2.jpg","muscle":"Overhead Lat","type":" Static","guide":["Sit upright on the floor with your partner behind you. Raise one arm straight up, and flex the elbow, attempting to touch your hand to your back. Your parner should hold your tricep and wrist. This will be your starting position.","Attempt to pull your upper arm to your side as your partner prevents you from doing actually doing so.","After 10-20 seconds, relax the arm and allow your partner to further stretch the lat by applying gentle pressure to the tricep. Hold for 10-20 seconds, and then switch sides."]},{"level":" Beginner","equipment":" Medicine Ball","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/905/Male/l/905_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/905/Male/l/905_2.jpg","muscle":"Overhead Slam","type":" Pull","guide":["Hold a medine ball with both hands and stand with your feet at shoulder width. This will be your starting position.","Initiate the countermovement by raising the ball above your head and fully extending your body.","Reverse the motion, slamming the ball into the ground directly in front of you as hard as you can.","Receive the ball with both hands on the bounce and repeat the movement."]},{"level":" Intermediate","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/433/Male/l/433_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/433/Male/l/433_2.jpg","muscle":"Pelvic Tilt Into Bridge","type":" Static","guide":["Lie down with your feet on the floor, heels directly under your knees.","Lift only your tailbone to the ceiling to stretch your lower back. (Don't lift the entire spine yet.) Pull in your stomach.","To go into a bridge, lift the entire spine except the neck."]},{"level":" Beginner","equipment":" Body Only","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/46/Male/l/46_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/46/Male/l/46_2.jpg","muscle":"Pullups","type":" Pull","guide":["Grab the pull-up bar with the palms facing forward using the prescribed grip. Note on grips: For a wide grip, your hands need to be spaced out at a distance wider than your shoulder width. For a medium grip, your hands need to be spaced out at a distance equal to your shoulder width and for a close grip at a distance smaller than your shoulder width.","As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.","Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.","Repeat this motion for the prescribed amount of repetitions."]},{"level":" Beginner","equipment":" Exercise Ball","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/434/Male/l/434_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/434/Male/l/434_2.jpg","muscle":"Pyramid","type":" Static","guide":["Start off by rolling your torso forward onto the ball so your hips rest on top of the ball and become the highest point of your body.","Rest your hands and feet on the floor. Your arms and legs can be slightly bent or straight, depending on the size of the ball, your flexibility, and the length of your limbs. This also helps develop stabilizing strength in your torso and shoulders."]},{"level":" Intermediate","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/741/Male/l/741_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/741/Male/l/741_2.jpg","muscle":"Rack Pull with Bands","type":" Pull","guide":["Set up in a power rack with the bar on the pins. The pins should be set to the desired point; just below the knees, just above, or in the mid thigh position. Attach bands to the base of the rack, or secure them with dumbbells. Attach the other end to the bar. You may need to choke the bands to provide tension.","Position yourself against the bar in proper deadlifting position. Your feet should be under your hips, your grip shoulder width, back arched, and hips back to engage the hamstrings. Since the weight is typically heavy, you may use a mixed grip, a hook grip, or use straps to aid in holding the weight.","With your head looking forward, extend through the hips and knees, pulling the weight up and back until lockout. Be sure to pull your shoulders back as you complete the movement. Return the weight to the pins and repeat."]},{"level":" Intermediate","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/710/Male/l/710_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/710/Male/l/710_2.jpg","muscle":"Rack Pulls","type":" Pull","guide":["Set up in a power rack with the bar on the pins. The pins should be set to the desired point; just below the knees, just above, or in the mid thigh position. Position yourself against the bar in proper deadlifting position. Your feet should be under your hips, your grip shoulder width, back arched, and hips back to engage the hamstrings. Since the weight is typically heavy, you may use a mixed grip, a hook grip, or use straps to aid in holding the weight.","With your head looking forward, extend through the hips and knees, pulling the weight up and back until lockout. Be sure to pull your shoulders back as you complete the movement.","Return the weight to the pins and repeat."]},{"level":" Expert","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/756/Male/l/756_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/756/Male/l/756_2.jpg","muscle":"Reverse Band Deadlift","type":" Pull","guide":["Set the bar up in a power rack. Attach bands to the top of the rack, using either bands pegs or the frame itself. Attach the other end of the bands to the bar.","Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.","With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward.","After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."]},{"level":" Intermediate","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/128/Male/l/128_2.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/128/Male/l/128_2.jpg","muscle":"Reverse Grip Bent-Over Rows","type":" Pull","guide":["Stand erect while holding a barbell with a supinated grip (palms facing up).","Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The barbell should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the barbell as you breathe out, keeping the elbows close to the body and not doing any force with the forearm other than holding the weights. On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."]},{"level":" Intermediate","equipment":" Foam Roll","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/616/Male/l/616_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/616/Male/l/616_2.jpg","muscle":"Rhomboids-SMR","type":" Static","guide":["Lay down with your back on the floor. Place a foam roll underneath your upper back, and cross your arms in front of you, protracting your shoulders. This will be your starting position.","Raise your hips off of the ground, placing your weight onto the foam roll. Shift your weight to one side at a time, rolling over your middle and upper back. Pause at points of tension for 10-30 seconds."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/279/Male/l/279_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/279/Male/l/279_2.jpg","muscle":"Rocky Pull-Ups/Pulldowns","type":" Pull","guide":["Grab the pull-up bar with the palms facing forward using a wide grip.","As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.","Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.","Now repeat the same movements as described above except this time your torso will remain straight as you go up and the bar will touch the back of the neck instead of the upper chest. Tip: Use the head to lean forward slightly as it will help you properly execute this portion of the exercise.","Once you have lowered yourself back down to the starting position, repeat the exercise for the prescribed amount of repetitions in your program."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1441/Male/l/1441_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1441/Male/l/1441_2.jpg","muscle":"Rope Climb","type":" Pull","guide":["Grab the rope with both hands above your head. Pull down on the rope as you take a small jump.","Wrap the rope around one leg, using your feet to pinch the rope. Reach up as high as possible with your arms, gripping the rope tightly.","Release the rope from your feet as you pull yourself up with your arms, bringing your knees towards your chest.","Resecure your feet on the rope, and then stand up to take another high hold on the rope. Continue until you reach the top of the rope.","To lower yourself, loosen the grip of your feet on the rope as you slide down using a hand over hand motion."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/2171/Male/l/2171_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/2171/Male/l/2171_2.jpg","muscle":"Rope Straight-Arm Pulldown","type":" Pull","guide":["Attach a rope to a high pulley and make your weight selection. Stand a couple feet back from the pulley with your feet staggered and take the rope with both hands. Lean forward from the hip, keeping your back straight, with your arms extended up in front of you. This will be your starting position.","Keeping your arms straight, extend the shoulder to pull the rope down to your thighs.","Pause at the bottom of the motion, squeezing your lats.","Return to the starting position without allowing the weight to fully rest on the stack."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/45/Male/l/45_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/45/Male/l/45_2.jpg","muscle":"Seated Cable Rows","type":" Pull","guide":["For this exercise you will need access to a low pulley row machine with a V-bar. Note: The V-bar will enable you to have a neutral grip where the palms of your hands face each other. To get into the starting position, first sit down on the machine and place your feet on the front platform or crossbar provided making sure that your knees are slightly bent and not locked.","Lean over as you keep the natural alignment of your back and grab the V-bar handles.","With your arms extended pull back until your torso is at a 90-degree angle from your legs. Your back should be slightly arched and your chest should be sticking out. You should be feeling a nice stretch on your lats as you hold the bar in front of you. This is the starting position of the exercise.","Keeping the torso stationary, pull the handles back towards your torso while keeping the arms close to it until you touch the abdominals. Breathe out as you perform that movement. At that point you should be squeezing your back muscles hard. Hold that contraction for a second and slowly go back to the original position while breathing in.","Repeat for the recommended amount of repetitions."]},{"level":" Intermediate","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/712/Male/l/712_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/712/Male/l/712_2.jpg","muscle":"Seated Good Mornings","type":" Pull","guide":["Set up a box in a power rack. The pins should be set at an appropriate height. Begin by stepping under the bar and placing it across the back of the shoulders, not on top of your traps. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders.","Remove the bar from the rack, creating a tight arch in your lower back. Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. This will be your starting position.","Keeping the bar tight, bend forward at the hips as much as possible. If you set the pins to what would be parallel, you not only have a safety if you fail, but know when to stop.","Pause just above the pins and reverse the motion until your torso it upright."]},{"level":" Intermediate","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/297/Male/l/297_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/297/Male/l/297_2.jpg","muscle":"Seated One-arm Cable Pulley Rows","type":" Pull","guide":["To get into the starting position, first sit down on the machine and place your feet on the front platform or crossbar provided making sure that your knees are slightly bent and not locked.","Lean over as you keep the natural alignment of your back and grab the single handle attachment with your left arm using a palms-down grip.","With your arm extended pull back until your torso is at a 90-degree angle from your legs. Your back should be slightly arched and your chest should be sticking out. You should be feeling a nice stretch on your lat as you hold the bar in front of you. The right arm can be kept by the waist. This is the starting position of the exercise.","Keeping the torso stationary, pull the handles back towards your torso while keeping the arms close to it as you rotate the wrist, so that by the time your hand is by your abdominals it is in a neutral position (palms facing the torso). Breathe out as you perform that movement. At that point you should be squeezing your back muscles hard.","Hold that contraction for a second and slowly go back to the original position while breathing in. Tip: Remember to rotate the wrist as you go back to the starting position so that the palms are facing down again.","Repeat for the recommended amount of repetitions and then perform the same movement with the right hand."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1971/Male/l/1971_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1971/Male/l/1971_2.jpg","muscle":"Shotgun Row","type":" Pull","guide":["Attach a single handle to a low cable.","After selecting the correct weight, stand a couple feet back with a wide-split stance. Your arm should be extended and your shoulder forward. This will be your starting position.","Perform the movement by retracting the shoulder and flexing the elbow. As you pull, supinate the wrist, turning the palm upward as you go.","After a brief pause, return to the starting position."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/280/Male/l/280_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/280/Male/l/280_2.jpg","muscle":"Side To Side Chins","type":" Pull","guide":["Grab the pull-up bar with the palms facing forward using a wide grip.","As you have both arms extended in front of you holding the bar at a wide grip, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.","Pull your torso up while leaning to the left hand side until the bar almost touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space (no swinging) and only the arms should move. The forearms should do no other work other than hold the bar.","After a second of contraction, inhale as you go back to the starting position.","Now, pull your torso up while leaning to the right hand side until the bar almost touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second of contraction, inhale as you go back to the starting position.","Repeat steps 3-6 until you have performed the prescribed amount of repetitions for each side."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/440/Male/l/440_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/440/Male/l/440_2.jpg","muscle":"Side-Lying Floor Stretch","type":" Static","guide":["First lie on your left side, bending your left knee in front of you to stabilize your torso (use your abdominal muscles as well to hold you upright).","Straighten your right leg and rest the right foot on the floor behind your left. Straighten your right arm over your head and gently pull on your right wrist to stretch the entire right side of the body. Switch sides."]},{"level":" Beginner","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1081/Male/l/1081_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1081/Male/l/1081_2.jpg","muscle":"Sled Row","type":" Pull","guide":["Attach dual handles to a sled connected by a rope or chain. Load the sled to an appropriate weight. Face the sled, backing up until there is some tension in the line.","With a handle in each hand, bend the knees slightly, keep your head and chest up, and begin with your arms extended.","To initiate the movement, flex the elbow as you retract your shoulder blades, pulling the sled towards you.","Take a step or two back to get tension in the line and repeat."]},{"level":" Beginner","equipment":" Machine","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/138/Male/l/138_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/138/Male/l/138_2.jpg","muscle":"Smith Machine Bent Over Row","type":" Pull","guide":["Set the barbell attached to the smith machine to a height that is about 2 inches below your knees.","Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up.","Now grasp the barbell using an overhand (pronated) grip and unlock it from the smith machine rack. Then let it hang directly in front of you as your arms hang extended perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the barbell as you breathe out, keeping the elbows close to the body and not doing any force with the forearm other than holding the weights. On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/481/Male/l/481_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/481/Male/l/481_2.jpg","muscle":"Spinal Stretch","type":" Static","guide":["Sit in a chair so your back is straight and your feet planted on the floor.","Interlace your fingers behind your head, elbows out and your chin down.","Twist your upper body to one side about 3 times as far as you can. Then lean forward and twist your torso to reach your elbow to the floor on the inside of your knee.","Return to upright position and then repeat for your other side."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/412/Male/l/412_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/412/Male/l/412_2.jpg","muscle":"Standing Pelvic Tilt","type":" Static","guide":["Start off with your feet hip-distance apart.","Bend your knees slightly to keep them soft and springy.","You may want to move your pelvis forward and backward and back few times before holding the tailbone forward in this stretch."]},{"level":" Beginner","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/86/Male/l/86_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/86/Male/l/86_2.jpg","muscle":"Stiff Leg Barbell Good Morning","type":" Push","guide":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position.","Keeping your legs stationary, move your torso forward by bending at the hips while inhaling. Lower your torso until it is parallel with the floor.","Begin to raise the bar as you exhale by elevating your torso back to the starting position.","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1951/Male/l/1951_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1951/Male/l/1951_2.jpg","muscle":"Straight Bar Bench Mid Rows","type":" Pull","guide":["Place a loaded barbell on the end of a bench. Standing on the bench behind the bar, take a medium, pronated grip. Stand with your hips back and chest up, maintaining a neutral spine. This will be your starting position.","Row the bar to your torso by retracting the shoulder blades and flexing the elbows. Use a controlled movement with no jerking.","After a brief pause, slowly return the bar to the starting position, ensuring to go all the way down."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/11/Male/l/11_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/11/Male/l/11_2.jpg","muscle":"Straight-Arm Pulldown","type":" Pull","guide":["You will start by grabbing the wide bar from the top pulley of a pulldown machine and using a wider than shoulder-width pronated (palms down) grip. Step backwards two feet or so.","Bend your torso forward at the waist by around 30-degrees with your arms fully extended in front of you and a slight bend at the elbows. If your arms are not fully extended then you need to step a bit more backwards until they are. Once your arms are fully extended and your torso is slightly bent at the waist, tighten the lats and then you are ready to begin.","While keeping the arms straight, pull the bar down by contracting the lats until your hands are next to the side of the thighs. Breathe out as you perform this step.","While keeping the arms straight, go back to the starting position while breathing in.","Repeat for the recommended amount of repetitions."]},{"level":" Beginner","equipment":" Body Only","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/228/Male/l/228_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/228/Male/l/228_2.jpg","muscle":"Superman","type":" Static","guide":["To begin, lie straight and face down on the floor or exercise mat. Your arms should be fully extended in front of you. This is the starting position.","Simultaneously raise your arms, legs, and chest off of the floor and hold this contraction for 2 seconds. Tip: Squeeze your lower back to get the best results from this exercise. Remember to exhale during this movement. Note: When holding the contracted position, you should look like superman when he is flying.","Slowly begin to lower your arms, legs and chest back down to the starting position while inhaling.","Repeat for the recommended amount of repetitions prescribed in your program."]},{"level":" Beginner","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1381/Male/l/1381_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1381/Male/l/1381_2.jpg","muscle":"Suspended Row","type":" Pull","guide":["Suspend your straps at around chest height. Take a handle in each hand and lean back. Keep your body erect and your head and chest up. Your arms should be fully extended. This will be your starting position.","Begin by flexing the elbow to initiate the movement. Protract your shoulder blades as you do so.","At the completion of the motion pause, and then return to the starting position."]},{"level":" Beginner","equipment":" Barbell","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1931/Male/l/1931_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/1931/Male/l/1931_2.jpg","muscle":"T-Bar Row with Handle","type":" Pull","guide":["Position a bar into a landmine or in a corner to keep it from moving. Load an appropriate weight onto your end.","Stand over the bar, and position a Double D row handle around the bar next to the collar. Using your hips and legs, rise to a standing position.","Assume a wide stance with your hips back and your chest up. Your arms should be extended. This will be your starting position.","Pull the weight to your upper abdomen by retracting the shoulder blades and flexing the elbows. Do not jerk the weight or cheat during the movement.","After a brief pause, return to the starting position."]},{"level":" Intermediate","equipment":" Kettlebells","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/531/Male/l/531_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/531/Male/l/531_2.jpg","muscle":"Two-Arm Kettlebell Row","type":" Pull","guide":["Place two kettlebells in front of your feet. Bend your knees slightly and then push your butt out as much as possible as you bend over to get in the starting position.","Grab both kettlebells and pull them to your stomach, retracting your shoulder blades and flexing the elbows. Keep your back straight. Lower and repeat."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/139/Male/l/139_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/139/Male/l/139_2.jpg","muscle":"Underhand Cable Pulldowns","type":" Pull","guide":["Sit down on a pull-down machine with a wide bar attached to the top pulley. Adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.","Grab the pull-down bar with the palms facing your torso (a supinated grip). Make sure that the hands are placed closer than the shoulder width.","As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.","As you breathe out, pull the bar down until it touches your upper chest by drawing the shoulders and the upper arms down and back. Tip: Concentrate on squeezing the back muscles once you reach the fully contracted position and keep the elbows close to your body. The upper torso should remain stationary as your bring the bar to you and only the arms should move. The forearms should do no other work other than hold the bar.","After a second on the contracted position, while breathing in, slowly bring the bar back to the starting position when your arms are fully extended and the lats are fully stretched.","Repeat this motion for the prescribed amount of repetitions."]},{"level":" Beginner","equipment":" None","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/450/Male/l/450_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/450/Male/l/450_2.jpg","muscle":"Upper Back Stretch","type":" Static","guide":["Clasp fingers together with your thumbs pointing down, round your shoulders as you reach your hands forward."]},{"level":" Intermediate","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/177/Male/l/177_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/177/Male/l/177_2.jpg","muscle":"V-Bar Pulldown","type":" Pull","guide":["Sit down on a pull-down machine with a V-Bar attached to the top pulley.","Adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.","Grab the V-bar with the palms facing each other (a neutral grip). Stick your chest out and lean yourself back slightly (around 30-degrees) in order to better engage the lats. This will be your starting position.","Using your lats, pull the bar down as you squeeze your shoulder blades. Continue until your chest nearly touches the V-bar. Exhale as you execute this motion. Tip: Keep the torso stationary throughout the movement.","After a second hold on the contracted position, slowly bring the bar back to the starting position as you breathe in.","Repeat for the prescribed number of repetitions."]},{"level":" Beginner","equipment":" Body Only","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/140/Male/l/140_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/140/Male/l/140_2.jpg","muscle":"V-Bar Pullup","type":" Pull","guide":["Start by placing the middle of the V-bar in the middle of the pull-up bar (assuming that the pull-up station you are using does not have neutral grip handles). The V-Bar handles will be facing down so that you can hang from the pull-up bar through the use of the handles.","Once you securely place the V-bar, take a hold of the bar from each side and hang from it. Stick your chest out and lean yourself back slightly in order to better engage the lats. This will be your starting position.","Using your lats, pull your torso up while leaning your head back slightly so that you do not hit yourself with the chin-up bar. Continue until your chest nearly touches the V-bar. Exhale as you execute this motion.","After a second hold on the contracted position, slowly lower your body back to the starting position as you breathe in.","Repeat for the prescribed number of repetitions."]},{"level":" Intermediate","equipment":" Exercise Ball","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/332/Male/l/332_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/332/Male/l/332_2.jpg","muscle":"Weighted Ball Hyperextension","type":" Pull","guide":["To begin, lie down on an exercise ball with your torso pressing against the ball and parallel to the floor. The ball of your feet should be pressed against the floor to help keep you balanced. Place a weighted plate under your chin or behind your neck. This is the starting position.","Slowly raise your torso up by bending at the waist and lower back. Remember to exhale during this movement.","Hold the contraction on your lower back for a second and lower your torso back down to the starting position while inhaling.","Repeat for the recommended amount of repetitions prescribed in your program."]},{"level":" Intermediate","equipment":" Other","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/928/Male/l/928_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/928/Male/l/928_2.jpg","muscle":"Weighted Pull Ups","type":" Pull","guide":["Attach a weight to a dip belt and secure it around your waist. Grab the pull-up bar with the palms of your hands facing forward. For a medium grip, your hands should be spaced at shoulder width. Both arms should be extended in front of you holding the bar at the chosen grip.","Youll want to bring your torso back about 30 degrees while creating a curvature in your lower back and sticking your chest out. This will be your starting position.","Now, exhale and pull your torso up until your head is above your hands. Concentrate on squeezing yourshoulder blades back and down as you reach the top contracted position.","After a brief moment at the top contracted position, inhale and slowly lower your torso back to the starting position with your arms extended and your lats fully stretched."]},{"level":" Beginner","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/10/Male/l/10_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/10/Male/l/10_2.jpg","muscle":"Wide-Grip Lat Pulldown","type":" Pull","guide":["Sit down on a pull-down machine with a wide bar attached to the top pulley. Make sure that you adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.","Grab the bar with the palms facing forward using the prescribed grip. Note on grips: For a wide grip, your hands need to be spaced out at a distance wider than shoulder width. For a medium grip, your hands need to be spaced out at a distance equal to your shoulder width and for a close grip at a distance smaller than your shoulder width.","As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.","As you breathe out, bring the bar down until it touches your upper chest by drawing the shoulders and the upper arms down and back. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the bar; therefore do not try to pull down the bar using the forearms.","After a second at the contracted position squeezing your shoulder blades together, slowly raise the bar back to the starting position when your arms are fully extended and the lats are fully stretched. Inhale during this portion of the movement.","Repeat this motion for the prescribed amount of repetitions."]},{"level":" Intermediate","equipment":" Cable","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/15/Male/l/15_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/15/Male/l/15_2.jpg","muscle":"Wide-Grip Pulldown Behind The Neck","type":" Pull","guide":["Sit down on a pull-down machine with a wide bar attached to the top pulley. Make sure that you adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.","Grab the bar with the palms facing forward using the prescribed grip. Note on grips: For a wide grip, your hands need to be spaced out at a distance wider than your shoulder width. For a medium grip, your hands need to be spaced out at a distance equal to your shoulder width and for a close grip at a distance smaller than your shoulder width.","As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso and head forward. Think of an imaginary line from the center of the bar down to the back of your neck. This is your starting position.","As you breathe out, bring the bar down until it touches the back of your neck by drawing the shoulders and the upper arms down and back. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the bar; therefore do not try to pull down the bar using the forearms.","After a second on the contracted position squeezing your shoulder blades together, slowly raise the bar back to the starting position when your arms are fully extended and the lats are fully stretched. Inhale during this portion of the movement.","Repeat this motion for the prescribed amount of repetitions."]},{"level":" Intermediate","equipment":" Body Only","pic1":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/191/Male/l/191_1.jpg","pic2":"http://www.bodybuilding.com/exercises/exerciseImages/sequences/191/Male/l/191_2.jpg","muscle":"Wide-Grip Rear Pull-Up","type":" Pull","guide":["Grab the pull-up bar with the palms facing forward using a wide grip.","As you have both arms extended in front of you holding the bar, bring your torso forward and head so that there is an imaginary line from the pull-up bar to the back of your neck. This is your starting position.","Pull your torso up until the bar is near the back of your neck. To do this, draw the shoulders and upper arms down and back while slightly leaning your head forward. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.","Repeat this motion for the prescribed amount of repetitions."]}]